blog/2021/unicode-segmentation-in-javascript.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 19:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Unicode Segmentation in JavaScript</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Unicode Segmentation in JavaScript</h1>
</header><p>
<a href="https://h3manth.com/posts/unicode-segmentation-in-javascript/">https://h3manth.com/posts/unicode-segmentation-in-javascript/</a>
</p>

<p>
Unicode 定义了一个字符分割算法来查找字符之间的边界。Unicode 还定义了一种算法，用于查找 <a href="https://en.wikipedia.org/wiki/Common_Locale_Data_Repository">CLDR</a> 根据地区设置调整的词和句子之间的边界。这些边界可能是有用的，例如，在实现一个文本编辑器，其中有跳跃或突出单词和句子的命令，<a href="https://tc39.es/proposal-intl-segmenter/">Intl.Segmenter</a> API 可以帮助我们轻松地分割这些代码点。
</p>

<p>
示例代码：
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">segmenter</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Intl.Segmenter</span>(<span style="color: #ddbc91;">"kn-IN"</span>, {granularity: <span style="color: #ddbc91;">"word"</span>});
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">input</span> = <span style="color: #ddbc91;">"&#3206;&#3253;&#3265; &#3208;&#3253;&#3263;&#3240; &#3240;&#3262;&#3253;&#3265; &#3240;&#3264;&#3253;&#3263;&#3223;&#3270; &#3206;&#3240;&#3265; &#3236;&#3262;&#3240;&#3238; &#3236;&#3240;&#3240;&#3240;&#3262;"</span>;
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">segments</span> = segmenter.segment(input);
<span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> {segment, index, isWordLike} of segments) {
  console.log(<span style="color: #ddbc91;">"segment at code units [%d, %d): &#171;%s&#187;%s"</span>,
    index, index + segment.length,
    segment,
    isWordLike ? <span style="color: #ddbc91;">" (word-like)"</span> : <span style="color: #ddbc91;">""</span>
  );
}
</pre>
</div>

<p>
更多内容阅读 <a href="https://github.com/tc39/proposal-intl-segmenter">GitHub：tc39/proposal-intl-segmenter</a>。</p>
</div>
</body>
</html>